#### ParameterFilterUtilities Members

---

|  |
| --- |
| ParameterFilterUtilities Class   Methods   See Also |

The  ParameterFilterUtilities  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetAllFilterableCategories | Returns the set of categories that may be used in a ParameterFilterElement. |
| Public method Static member | GetFilterableParametersInCommon | Returns the filterable parameters common to the given categories. |
| Public method Static member | GetInapplicableParameters | Returns the parameters that are not among the set of filterable parameters common to the given categories. |
| Public method Static member | IsParameterApplicable | Used to determine whether the element supports the given parameter. |
| Public method Static member | RemoveUnfilterableCategories | Removes from the given set the categories that are not filterable. |

# See Also

ParameterFilterUtilities Class

Autodesk.Revit.DB Namespace